/* Copyright (C) 2021 The uOFW team
See the file COPYING for copying permission.
*/

#include <common/types.h>

#include <adhoc/pspnet_adhoc.h>
#include <adhoc/pspnet_adhoc_auth.h>
#include <adhoc/pspnet_adhocctl.h>
#include <common_imp.h>
#include <net/psp_net_error.h>
#include <pspnet/pspnet.h>
#include <pspwlan.h>
#include <registry/registry.h>
#include <sysmem_kdebug.h>
#include <threadman_kernel.h>
#include <usersystemlib_kernel.h>
#include <utility/utility_sysparam.h>
#include <wlan.h>

/**
 * uofw/src/net/pspnet_adhocctl.c
 *
 * PSP Adhoc control - PSP Adhoc control networking libraries
 *
 * I honestly don't know what this does yet.
 * TODO: Figure that out
 */

// 0x6418 - Debug ADHOCTYPE warning
const char g_AdhocRegString[] = "/CONFIG/NETWORK/ADHOC"; // 0x650C
const char g_SSIDPrefixRegKey[] = "ssid_prefix";         // 0x6524
const char g_WifiAdapter[] = "wlan";                     // 0x6534
const char g_SSIDSeparator = '_';                        // 0x653C
const char g_ThreadName[] = "SceNetAdhocctl";            // 0x6540
const char g_DefSSIDPrefix[] = "PSP";                    // 0x6550
const char g_WifiAdapter2[] = "wlan";                    // 0x6554
const char g_WifiAdapter3[] = "wlan";                    // 0x655C
const char g_WifiAdapter4[] = "wlan";                    // 0x6564
const char g_MutexName[] = "SceNetAdhocctl";             // 0x656C
const char g_Unk9;                                       // 0x657B
const char g_AllChannels[3] = {11, 6, 1};    // 0x657C

int g_Init = 0; // 0x66D0
char g_SSIDPrefix[4]; // 0x66D4

struct unk_struct g_Unk; // 0x66D8

struct unk_struct2 g_Unk2; // 0x6EB0

// Vars at: [((fptr) 0x4), (0xC)] * (i * 0x10)
struct AdhocHandler *g_Unk4[4]; // 0x6F70

struct AdhocHandler *g_Unk5[4]; // 0x6FB0

// Seems to store data per channel
struct unk_struct3 g_Unk6[3]; // 0x6FF0

struct GameModeArea g_GameModeArea; // 0x7014

// 0x00 = next?
// 0x0a = channel
struct ScanData g_ScanBuffer[32]; // 0x7418 = 3072 bytes

s32 g_MutexInited;  // 0x1948
SceLwMutex g_Mutex; // 0x194C

SCE_MODULE_INFO(
        "sceNetAdhocctl_Library",
        SCE_MODULE_ATTR_EXCLUSIVE_LOAD | SCE_MODULE_ATTR_EXCLUSIVE_START,
        1, 6);

SCE_SDK_VERSION(SDK_VERSION);

s32 CreateLwMutex();

void DeleteLwMutex();

s32 GetChannelAndSSID(struct unk_struct *unpackedArgs, char *ssid, u32 *channel);

int GameModeParseBeaconFrame(struct unk_struct2 *param_1, char *channel, char *unk);

s32 FUN_000054d8(char param_1);

s32 ScanAndConnect(struct unk_struct *unpackedArgs);

/**
 * Builds the SSID to be used to make the connection.
 *
 * @param unpackedArgs Pointer to struct with all the information.
 * @param ssid The resulting SSID.
 * @param adhocSubType Whether it's normal adhoc or gamemode (G/L).
 * @param ssidSuffix What to put behind the last separator.
 *
 * @return Length of the SSID.
 */
s32 BuildSSID(struct unk_struct *unpackedArgs, char *ssid, char adhocSubType, char *ssidSuffix);

/**
 * Gets the prefix of the SSID (PSP)
